(*------------------------------------------------------------------------------
  -- ＮＯＴＡＴＩＯＮＳ
  ----------------------------------------------------------------------------*)


(* -- Ｃｏｒｅ  ｎｏｔａｔｉｏｎｓ                                         -- *)
Notation "⊤" := True.
Notation "⊥" := False.
Infix "⟨⊎⟩" := sum (at level 50, left associativity).
Infix "⟨×⟩" := prod (at level 40, left associativity).
(*----------------------------------------------------------------------------*)


(* -- Ｃａｔｅｇｏｒｙ ｎｏｔａｔｉｏｎｓ                                 - --*)
Reserved Notation "A ⇒ B" (at level 30, right associativity).
Reserved Notation "f ∘ g" (at level 40, left associativity).
(*----------------------------------------------------------------------------*)
